# Data Integration

In [51]:
import pandas as pd
import numpy as np

In [25]:
## Merging
biodata = pd.DataFrame({'id': ['id0', 'id1', 'id2', 'id3'],
                     'JK': ['P', 'P', 'L', 'L'], # JK=Jenis Kelamin
                     'Usia': ['19', '21', '18', '23']})

nilai = pd.DataFrame({'id': ['id0', 'id1', 'id2', 'id3'],
                      'IPK': ['3.94', '3.34', '3.75', '3.11'],
                      'Nilai': ['A', 'AB', 'AB', 'B']})

result1 = pd.merge(biodata, nilai, on='id')
result1

In [20]:
## Merging different key id
biodata = pd.DataFrame({'id': ['id0', 'id1', 'id2', 'id3','id4','id5'],
                     'JK': ['P', 'P', 'L', 'L','L','P'], # JK=Jenis Kelamin
                     'Usia': ['19', '21', '18', '23','17','19']})

nilai = pd.DataFrame({'id': ['id0', 'id1', 'id2', 'id3'],
                      'IPK': ['3.94', '3.34', '3.75', '3.11'],
                      'Nilai': ['A', 'AB', 'AB', 'B']})

result2 = pd.merge(biodata, nilai, on='id')
result2

In [28]:
# Ordering variable/column
result1 = result1[['id', 'JK', 'Usia', 'Nilai','IPK']]
result1

In [38]:
# Multiple key
biodata = pd.DataFrame({'id': ['id0', 'id0', 'id1', 'id1'],
                        'Kelas': ['Kalkulus', 'ADE', 'Kalkulus', 'ADW'],
                        'JK': ['P', 'P', 'L', 'L'], 
                      'Usia': ['19', '21', '18', '23']})

nilai = pd.DataFrame({'id': ['id0', 'id0', 'id1', 'id1'],
                      'Kelas': ['Kalkulus', 'ADK', 'MO', 'ADW'],
                      'IPK': ['3.94', '3.34', '3.75', '3.11'],
                      'Nilai': ['A', 'AB', 'AB', 'B']})

result3 = pd.merge(biodata, nilai, on=['id', 'Kelas'])
result3

In [41]:
# Merge methods (default how="inner")
result_left = pd.merge(biodata, nilai, how='left', on=['id', 'Kelas'])
result_left

  JK     Kelas Usia   id   IPK Nilai
0  P  Kalkulus   19  id0  3.94     A
1  P       ADE   21  id0   NaN   NaN
2  L  Kalkulus   18  id1   NaN   NaN
3  L       ADW   23  id1  3.11     B

In [42]:
# Merge methods (default how="inner")
result_right = pd.merge(biodata, nilai, how='right', on=['id', 'Kelas'])
result_right

    JK     Kelas Usia   id   IPK Nilai
0    P  Kalkulus   19  id0  3.94     A
1    L       ADW   23  id1  3.11     B
2  NaN       ADK  NaN  id0  3.34    AB
3  NaN        MO  NaN  id1  3.75    AB

In [45]:
result_outer = pd.merge(biodata, nilai, how='outer', on=['id', 'Kelas'])
result_outer

    JK     Kelas Usia   id   IPK Nilai
0    P  Kalkulus   19  id0  3.94     A
1    P       ADE   21  id0   NaN   NaN
2    L  Kalkulus   18  id1   NaN   NaN
3    L       ADW   23  id1  3.11     B
4  NaN       ADK  NaN  id0  3.34    AB
5  NaN        MO  NaN  id1  3.75    AB

In [46]:
result_inner = pd.merge(biodata, nilai, how='inner', on=['id', 'Kelas'])
result_inner

  JK     Kelas Usia   id   IPK Nilai
0  P  Kalkulus   19  id0  3.94     A
1  L       ADW   23  id1  3.11     B

In [57]:
## Joining 
biodata = pd.DataFrame({'JK': ['P', 'P', 'L'], 
                      'Usia': ['19', '21', '18']},
                    index=['id0', 'id1', 'id2'])
nilai = pd.DataFrame({'Kelas': ['Kalkulus', 'ADK', 'MO'],
                      'IPK': ['3.94', '3.34', '3.75']},
                    index=['id0', 'id2', 'id3'])
result = biodata.join(nilai) #Based Biodata ditambahkan nilai
result

    JK Usia   IPK     Kelas
id0  P   19  3.94  Kalkulus
id1  P   21   NaN       NaN
id2  L   18  3.34       ADK

In [54]:
result = nilai.join(biodata, how='outer') #Seluruh data masuk
result

      IPK     Kelas   JK Usia
id0  3.94  Kalkulus    P   19
id1   NaN       NaN    P   21
id2  3.34       ADK    L   18
id3  3.75        MO  NaN  NaN

In [55]:
result = nilai.join(biodata, how='inner') # Hanya data yang lengkap
result

      IPK     Kelas JK Usia
id0  3.94  Kalkulus  P   19
id2  3.34       ADK  L   18

In [58]:
#The data alignment here is on the indexes (row labels). 
#This same behavior can be achieved using merge plus additional arguments instructing it to use the indexes
result = pd.merge(biodata, nilai, left_index=True, right_index=True, how='outer')
result

      JK Usia   IPK     Kelas
id0    P   19  3.94  Kalkulus
id1    P   21   NaN       NaN
id2    L   18  3.34       ADK
id3  NaN  NaN  3.75        MO

In [59]:
result = pd.merge(biodata, nilai, left_index=True, right_index=True, how='inner')
result

    JK Usia   IPK     Kelas
id0  P   19  3.94  Kalkulus
id2  L   18  3.34       ADK

In [60]:
biodata = pd.DataFrame({'JK': ['P', 'L', 'P', 'L'], 
                      'Usia': ['19', '21', '18', '23'],
                   'key': ['id0', 'id1', 'id0', 'id1']})
nilai = pd.DataFrame({'Nilai': ['A', 'B'],
                       'IPK': ['3.44', '3.74']},
                      index=['id0', 'id1'])
result = biodata.join(nilai, on='key')
result

  JK Usia  key   IPK Nilai
0  P   19  id0  3.44     A
1  L   21  id1  3.74     B
2  P   18  id0  3.44     A
3  L   23  id1  3.74     B

In [64]:
## Concatenating
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                'B': ['B0', 'B1', 'B2', 'B3'],
                'C': ['C0', 'C1', 'C2', 'C3'],
                'D': ['D0', 'D1', 'D2', 'D3']})
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                'B': ['B4', 'B5', 'B6', 'B7'],
                'C': ['C4', 'C5', 'C6', 'C7'],
                'D': ['D4', 'D5', 'D6', 'D7']})
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                'B': ['B8', 'B9', 'B10', 'B11'],
                'C': ['C8', 'C9', 'C10', 'C11'],
                'D': ['D8', 'D9', 'D10', 'D11']})

frames = [df1, df2, df3]
result = pd.concat(frames)
result

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [65]:
# Add category
result = pd.concat(frames, keys=['X', 'Y', 'Z'])
result

       A    B    C    D
X 0   A0   B0   C0   D0
  1   A1   B1   C1   D1
  2   A2   B2   C2   D2
  3   A3   B3   C3   D3
Y 0   A4   B4   C4   D4
  1   A5   B5   C5   D5
  2   A6   B6   C6   D6
  3   A7   B7   C7   D7
Z 0   A8   B8   C8   D8
  1   A9   B9   C9   D9
  2  A10  B10  C10  D10
  3  A11  B11  C11  D11

In [68]:
# Default join=outer (join all rows)
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                    index=[2, 3, 6, 7])

result = pd.concat([df1, df4], axis=0) #axis=1 is for concated by y-axis; default axis=0
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [69]:
# Join = inner (join only rows that exist in both datasets) 
# hanya yang ada di df1 dan df4
result = pd.concat([df1, df4], axis=1, join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [70]:
# Join the exact rows in df1 
#Menggabungkan berdasarkan df1
result = pd.concat([df1, df4], axis=1, join_axes=[df1.index])
result

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [17]:
## Concatenating using append
result = df1.append(df2) #default axis=0
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [72]:
result = df1.append(df4)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [19]:
result = df1.append([df2, df3]) #multiple datasets to concatenate
result

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [74]:
# For DataFrames which dont have a meaningful index, 
#you may wish to append them and ignore the fact that they may have overlapping indexes.
result = pd.concat([df1, df4], ignore_index=True)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [75]:
result = df1.append(df4, ignore_index=True)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [76]:
# Appending rows to a DataFrame
s2 = pd.Series(['X0', 'X1', 'X2', 'X3'], index=['A', 'B', 'C', 'D'])
result = df1.append(s2, ignore_index=True)
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  X0  X1  X2  X3

In [78]:
dicts = [{'A': 1, 'B': 2, 'C': 3, 'X': 4}, #dictionary
         {'A': 5, 'B': 6, 'C': 7, 'Y': 8}]
result = df1.append(dicts, ignore_index=True)
result

    A   B   C    D    X    Y
0  A0  B0  C0   D0  NaN  NaN
1  A1  B1  C1   D1  NaN  NaN
2  A2  B2  C2   D2  NaN  NaN
3  A3  B3  C3   D3  NaN  NaN
4   1   2   3  NaN  4.0  NaN
5   5   6   7  NaN  NaN  8.0